package com.company.training.cycle;

/* С помощью оператора while напишите программу вывода всех четных чисел в диапазоне от 2 до 100
включительно.
*/

public class Task4 {
	
	public static void main(String[] args) {
		
		int x;
		
		x = 2;
		
		while (x < 101) {
			
		System.out.println(x);
		
		x += 2;
		
		}
	}

}
